In [1]:
import pandas as pd

In [2]:
'11 12 13 14'.split()

['11', '12', '13', '14']

In [3]:
data = [(1, 2, 3, 4), 
       (5, 6, 7 ,8),
       (9, 10, 11, 12),
       (13, 14, 15, 16)]
df = pd.DataFrame(data, '11 12 13 14'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [5]:
df['c1']

11     1
12     5
13     9
14    13
Name: c1, dtype: int64

In [6]:
type(df[['c1', 'c3']])

pandas.core.frame.DataFrame

In [7]:
df[1:2]

    c1  c2  c3  c4
12   5   6   7   8

In [8]:
df[1:][['c1', 'c3']]

    c1  c3
12   5   7
13   9  11
14  13  15

In [9]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [12]:
df.loc['13']

c1     9
c2    10
c3    11
c4    12
Name: 13, dtype: int64

In [13]:
df.loc[['13', '14']]

    c1  c2  c3  c4
13   9  10  11  12
14  13  14  15  16

In [16]:
df.loc['11', 'c2']

2

In [19]:
df.iloc[0, 1]

2

In [20]:
df.loc[['13', '11'], ['c4', 'c1']]

    c4  c1
13  12   9
11   4   1

In [21]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [22]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
13  12   9
11   4   1